w1_l1_notes.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Lecture notes <span class="timestamp-wrapper"><span class="timestamp">&lt;2015-08-10 Mon&gt;</span></span></a>
<ul>
<li><a href="#sec-1-1">Relevant info</a></li>
<li><a href="#sec-1-2">Important websites</a></li>
<li><a href="#sec-1-3">Lecture 1</a></li>
<li><a href="#sec-1-4">Next class</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Lecture notes <span class="timestamp-wrapper"><span class="timestamp">&lt;2015-08-10 Mon&gt;</span></span></h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Relevant info</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Slides for this are at <i>slides/w1_l1_slides.pdf</i>, sources are also in
the slides directory.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Important websites</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><a href="https://piazza.com/udec.cl/fall2015/503208/home">https://piazza.com/udec.cl/fall2015/503208/home</a> (REGISTER!)
</li>
<li><a href="http://leoferres.github.io/503208_2015_2.html">http://leoferres.github.io/503208_2015_2.html</a>
</li>
<li><a href="https://github.com/leoferres/lp1">https://github.com/leoferres/lp1</a>
</li>
<li><a href="https://github.com/leoferres/">https://github.com/leoferres/</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Lecture 1</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><b>Introduction</b>: This is the first "real" Computer Science course
in the CS degree at UdeC. My name is Leo Ferres, but you can
call me Leo. Started programming at 9 yo in Argentina on a CZ
1500 (clone of the Timex Sinclair 1500, the "American" version
of the ZX81, plus expansion to 16Kb). My mom then bought me a
48Kb TK90X, a Brazilian clone of the British ZX Sepctrum, but
that's another story. Moved to Canada to do my PhD, and arrived
in Chile in 2008. I do research on HPC, parallel algorithms, and
social network analysis.

<p>
The objective of this course is to give you the most basic
conceptual tools you need to understand programming. However,
this is not your run-o'-the-mill, vanilla, Java-ish programming
course. It will not teach you (many) good practices of software
engineering, nor will it teach you how to be a good programmer
(who could in a Semester, anyway). What it will do is teach you
to understand how a computer does what you tell it to do through
a computer programming language. Programming is not black magic,
and computers are not black boxes, my job in this course is to
make both transparent.
</p>

<p>
We will use C, but the syntax is irrelevant. I could have picked
any programming language. However, C gives me the control I need
and it is lean enough to teach you the concepts I want to teach
you. In fact, if I am successful teaching you those concepts, at
the end of this courseyou will be able to easily learn any
computer syntax with minimum effort (well, maybe not
Prolog&#x2026; but still).
</p>

<p>
We will try to teach you, through exercises, some problem
solving skills. Collaboration is allowed on assignments, but the
final report is up to you. (See below). I will try to tell you
some compsci/programming history along the way. We have a great
discipline, with some great stories to tell.
</p>

<p>
Aaaaand, we have lots of awesome geeky tools to learn that will
make you a H4x0r (leet speak).
</p>
</li>

<li><b>Administration</b>:

<ul class="org-ul">
<li>Evaluation

<ul class="org-ul">
<li>Exams: really hard, study hard!
<ul class="org-ul">
<li>even if 60/40, avg is not weighted
</li>
<li>you do not pass the exams, you do not pass the class, no
matter what other marks you have.
</li>
</ul>
</li>

<li>Assignments:
<ul class="org-ul">
<li>you do not pass the assignments, you do not pass the
class, no matter what other marks you have.
</li>
<li>lab exam: I think this year they will all be lab exams. I
still need to figure out the logistics, but it will have
to do with google forms (check them out if you want).
</li>
<li>you can collaborate, document is an individual project
(must show me you understood).
</li>
<li>details on how to submit are TBA (will prob change this
year)
</li>
</ul>
</li>

<li>class participation: measured on your contributions in
Piazza. at the end, the 10 most active contributors get 2%.
</li>

<li>bonus 1% if you transcribe a lecture, but only if you've
passed the course (so, only to improve your final mark).
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Next class</h3>
<div class="outline-text-3" id="text-1-4">
<p>
We will be working with some new tools! Check out Linux (Xubuntu), the
xfce terminal, emacs, github, irssi (irc). URLs in slides.
</p>
</div>
</div>
</div>
